In [3]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass  # To get the password without showing the input

In [4]:
password = getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

### How many distinct (different) actors' last names are there?

In [6]:
query1 = 'SELECT last_name \
FROM sakila.actor \
GROUP BY last_name \
HAVING COUNT(*) = 1'
data = pd.read_sql_query(query1, engine)
data.head()
data.shape

(66, 1)

### Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week

In [7]:
query2 = 'SELECT *, weekday(rental_date), \
CASE \
WHEN weekday(rental_date) = "0" then "workday"\
WHEN weekday(rental_date) = "1" then "workday"\
WHEN weekday(rental_date) = "2" then "workday"\
WHEN weekday(rental_date) = "3" then "workday"\
WHEN weekday(rental_date) = "4" then "workday"\
WHEN weekday(rental_date) = "5" then "workday"\
ELSE "weekend"\
END AS "day type"\
FROM sakila.rental ';
data = pd.read_sql_query(query2, engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,weekday(rental_date),day type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,1,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,1,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,1,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,1,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,1,workday

### Get all films with ARMAGEDDON in the title.

In [8]:
query3 = 'SELECT * \
FROM sakila.film \
WHERE title = "ARMAGEDDON" ';
data = pd.read_sql_query(query3, engine)
data.head()

Empty DataFrame
Columns: [film_id, title, description, release_year, language_id, original_language_id, rental_duration, rental_rate, length, replacement_cost, rating, special_features, last_update]
Index: []

### Get 10 the longest films.

In [9]:
query4 = 'SELECT title, length \
FROM sakila.film \
ORDER BY length DESC \
LIMIT 10 ';
data = pd.read_sql_query(query4, engine)
data.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

### How many films include Behind the Scenes content?

In [10]:
query5 = 'SELECT title \
FROM sakila.film \
WHERE special_features \
LIKE "Behind the Scenes" ';
data = pd.read_sql_query(query5, engine)
data.head()

                  title
0        ATLANTIS CAUSE
1  BARBARELLA STREETCAR
2     BOONDOCK BALLROOM
3         BOUND CHEAPER
4   BROTHERHOOD BLANKET

### Which kind of movies (rating) have a mean duration of more than two hours?

In [11]:
query6 = ' select rating, round(avg(length),2) as avg_duration \
from sakila.film \
group by rating \
having avg_duration > 120 ';
data = pd.read_sql_query(query6, engine)
data.head()

  rating  avg_duration
0  PG-13        120.44

### Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [12]:
query7 = 'SELECT title, length \
FROM sakila.film \
WHERE length != 0 AND length IS NOT NULL \
ORDER BY length DESC ';
data = pd.read_sql_query(query7, engine)
data.head()

            title  length
0   CHICAGO NORTH     185
1  CONTROL ANTHEM     185
2  DARN FORRESTER     185
3     GANGS PRIDE     185
4       HOME PITY     185